wrzruozhou/STM32H750/drv/inc/drv_noflash.h
#ifndef __DRV_NORFLASH_H
#define __DRV_NORFLASH_H

#include "stm32h7xx_hal.h"
#include "stdio.h"
#include "drv_qspi.h"

#define W25Q128 0xef17      /*这个好像是NM25Q128的制造ID*/

#define FLASH_WriteEnable           0x06 
#define FLASH_WriteDisable          0x04 
#define FLASH_ReadStatusReg1        0x05 
#define FLASH_ReadStatusReg2        0x35 
#define FLASH_ReadStatusReg3        0x15 
#define FLASH_WriteStatusReg1       0x01 
#define FLASH_WriteStatusReg2       0x31 
#define FLASH_WriteStatusReg3       0x11 
#define FLASH_ReadData              0x03 
#define FLASH_FastReadData          0x0B 
#define FLASH_FastReadDual          0x3B 
#define FLASH_FastReadQuad          0xEB  
#define FLASH_PageProgram           0x02 
#define FLASH_PageProgramQuad       0x32 
#define FLASH_BlockErase            0xD8 
#define FLASH_SectorErase           0x20 
#define FLASH_ChipErase             0xC7 
#define FLASH_PowerDown             0xB9 
#define FLASH_ReleasePowerDown      0xAB 
#define FLASH_DeviceID              0xAB 
#define FLASH_ManufactDeviceID      0x90 
#define FLASH_JedecDeviceID         0x9F 
#define FLASH_Enable4ByteAddr       0xB7
#define FLASH_Exit4ByteAddr         0xE9
#define FLASH_SetReadParam          0xC0 
#define FLASH_EnterQPIMode          0x38
#define FLASH_ExitQPIMode           0xFF

void noreflash_init(void);
void norflash_write_enable(void);
void norflash_write_disable(void);
uint8_t norflash_read_sr(uint8_t regno);
void norflash_write_sr(uint8_t regno, uint8_t sr);
uint16_t norflash_read_id(void);
void norflash_read(uint8_t* pbuf, uint32_t addr, uint16_t datalen);
static void norflash_write_page(uint8_t* pbuf, uint32_t addr, uint16_t datalen);
static void norflash_write_nocheck(uint8_t* pbuf, uint32_t addr, uint16_t datalen);
void norflash_write(uint8_t* pbuf, uint32_t addr, uint16_t datalen);

void norflash_erase_chip(void);
void norflash_erase_sector(uint32_t saddr);

#endif // !__DRV_NORFLASH_H

